---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RadialDimensionChangeRadiusFailed
source: html/595a9e38-376c-c347-a6fd-c40b8ca576d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RadialDimensionChangeRadiusFailed Property

Can't change radius.

## Syntax (C#)
```csharp
public static FailureDefinitionId RadialDimensionChangeRadiusFailed { get; }
```